#!/bin/sh
# 実験で撮影した動画データに対して，手技Idと医者Idを付与したフォルダとファイルを作るためのプログラム
# 

dirs=`ls -d ../2023*`
dirbase=`basename $dirs`

# 瞼，眼球運動でカットしているものがある．
# 眼球運動，前後左右がある．分類できてない．

# dir_path=$@

# new_dirs=(
#     "0_c_20231103101658683273"
#     "1_b_20231103102302197129"
#     "2_a_20231103103438865789"
#     "3_a_20231103104605959603"
#     "4_a_20231103104818182554"
#     "5_c_20231103105544911235"
#     "4_c_20231103110016951592"
#     "4_c_20231103110120936822"
#     "2_c_20231103110622615664"
#     "2_c_20231103110821339674"
#     "6_c_20231103110920094980"
#     "6_c_20231103111251990619"
#     "7_a_20231103111734421972"
#     "7_a_20231103112258017927"
#     "8_a_20231103112505554741"
# )

labels=(
    "0_c_"
    "1_b_"
    "2_a_"
    "3_a_"
    "4_a_"
    "5_c_"
    "4_c_"
    "4_c_"
    "2_c_"
    "2_c_"
    "6_c_"
    "6_c_"
    "7_a_"
    "7_a_"
    "8_a_"
)

i=0
# echo $dirs
for dir in ${dirbase[@]}; do
    echo $dir
    cp -r "../${dir}" "./${labels[i]}${dir}"
    files=`ls "${labels[i]}${dir}"`
    # echo $files
    for file in $files; do
        mv "${labels[i]}${dir}/${file}" "${labels[i]}${dir}/${labels[i]}${file}" 
        echo 
    done
    i=`expr $i + 1`
done
